[
    {
        "author": "Andrew Hunt & David Thomas",
        "description": "Straight from the programming trenches, The Pragmatic Programmer cuts through the increasing specialization and technicalities of modern software development to examine the core process--taking a requirement and producing working, maintainable code that delights its users. It covers topics ranging from personal responsibility and career development to architectural techniques for keeping your code flexible and easy to adapt and reuse.",
        "id": "58428a14734d1d2b0ced5760",
        "image": "https://images-na.ssl-images-amazon.com/images/I/41BKx1AxQWL._SX396_BO1,204,203,200_.jpg",
        "isbn10": "2070464237",
        "pages": 352,
        "price": 31.9,
        "rating": 4,
        "title": "The Pragmatic Programmer",
        "votes": 141,
        "category": "Motivation"
    },
    {
        "author": "Robert C. Martin",
        "description": "\"Even bad code can function. But if code isn't clean, it can bring a development organization to its knees. Every year, countless hours and significant resources are lost because of poorly written code. But it doesn't have to be that way.  Noted software expert Robert C. Martin presents a revolutionary paradigm with \"Clean Code: A Handbook of Agile Software Craftsmanship.\" Martin has teamed up with his colleagues from Object Mentor to distill their best agile practice of cleaning code \"on the fly\" into a book that will instill within you the values of a software craftsman and make you a better programmer--but only if you work at it.\"",
        "id": "58428a3c734d1d2b0ced5768",
        "image": "https://images-na.ssl-images-amazon.com/images/I/41TINACY3hL._SX384_BO1,204,203,200_.jpg",
        "isbn10": "2070464237",
        "pages": 736,
        "price": 35.9,
        "rating": 4,
        "title": "Clean Code",
        "votes": 141,
        "category": "Application-Architecture"
    },
    {
        "author": "Eric Freeman & Bert Bates & Kathy Sierra",
        "description": "At any given moment, someone struggles with the same software design problems you have. And, chances are, someone else has already solved your problem. This edition of Head First Design Patterns—now updated for Java 8—shows you the tried-and-true, road-tested patterns used by developers to create functional, elegant, reusable, and flexible software. By the time you finish this book, you’ll be able to take advantage of the best design practices and experiences of those who have fought the beast of software design and triumphed.",
        "id": "58428a57734d1d2b0ced5770",
        "image": "https://images-na.ssl-images-amazon.com/images/I/61APhXCksuL._SX430_BO1,204,203,200_.jpg",
        "isbn10": "2070464237",
        "pages": 736,
        "price": 35.5,
        "rating": 4,
        "title": "Head First Design Patterns",
        "votes": 141,
        "category": "Application-Architecture"
    },
    {
        "author": "Martin Fowler",
        "description": "As the application of object technology--particularly the Java programming language--has become commonplace, a new problem has emerged to confront the software development community. Significant numbers of poorly designed programs have been created by less-experienced developers, resulting in applications that are inefficient and hard to maintain and extend. Increasingly, software system professionals are discovering just how difficult it is to work with these inherited, non-optimal applications. For several years, expert-level object programmers have employed a growing collection of techniques to improve the structural integrity and performance of such existing software programs.",
        "id": "58428a75734d1d2b0ced577a",
        "image": "https://images-na.ssl-images-amazon.com/images/I/51K-M5hR8qL._SX392_BO1,204,203,200_.jpg",
        "isbn10": "2070464237",
        "pages": 736,
        "price": 45.5,
        "rating": 4,
        "title": "Refactoring: Improving the Design of Existing Code",
        "votes": 141,
        "category": "Application-Architecture"
    },
    {
        "author": "John Resig  & Bear Bibeault",
        "description": "More than ever, the web is a universal platform for all types of applications, and JavaScript is the language of the web. If you're serious about web development, it's not enough to be a decent JavaScript coder. You need to be ninja-stealthy, efficient, and ready for anything. This book shows you how.  Purchase of the print book includes a free eBook in PDF, Kindle, and ePub formats from Manning Publications.",
        "id": "58428a8e734d1d2b0ced577e",
        "image": "https://images-na.ssl-images-amazon.com/images/I/51tQ%2BJAczgL._SX396_BO1,204,203,200_.jpg",
        "isbn10": "2070464237",
        "pages": 736,
        "price": 10.9,
        "rating": 4,
        "title": "Secrets of the JavaScript Ninja",
        "votes": 141,
        "category": "JavaScript-Programming"
    },
    {
        "author": "Douglas Crockford",
        "description": "Most programming languages contain good and bad parts, but JavaScript has more than its share of the bad, having been developed and released in a hurry before it could be refined. This authoritative book scrapes away these bad features to reveal a subset of JavaScript that's more reliable, readable, and maintainable than the language as a whole—a subset you can use to create truly extensible and efficient code.",
        "id": "58428aab734d1d2b0ced5782",
        "image": "https://images-na.ssl-images-amazon.com/images/I/5131OWtQRaL._SX381_BO1,204,203,200_.jpg",
        "isbn10": "2070464237",
        "pages": 736,
        "price": 24.5,
        "rating": 4,
        "title": "JavaScript: The Good Parts.",
        "votes": 141,
        "category": "JavaScript-Programming"
    },
    {
        "author": "David Flanagan",
        "description": "Since 1996, JavaScript: The Definitive Guide has been the bible for JavaScript programmers—a programmer's guide and comprehensive reference to the core language and to the client-side JavaScript APIs defined by web browsers.  The 6th edition covers HTML5 and ECMAScript 5. Many chapters have been completely rewritten to bring them in line with today's best web development practices. New chapters in this edition document jQuery and server side JavaScript. It's recommended for experienced programmers who want to learn the programming language of the Web, and for current JavaScript programmers who want to master it.",
        "id": "58428aca734d1d2b0ced578e",
        "image": "https://images-na.ssl-images-amazon.com/images/I/51WD-F3GobL._SX379_BO1,204,203,200_.jpg",
        "isbn10": "2070464237",
        "pages": 736,
        "price": 29.9,
        "rating": 4,
        "title": "JavaScript: The Definitive Guide",
        "votes": 141,
        "category": "JavaScript-Programming"
    },
    {
        "author": "Eric T. Freeman & Elisabeth Robson",
        "description": "This brain-friendly guide teaches you everything from JavaScript language fundamentals to advanced topics, including objects, functions, and the browser’s document object model. You won’t just be reading—you’ll be playing games, solving puzzles, pondering mysteries, and interacting with JavaScript in ways you never imagined. And you’ll write real code, lots of it, so you can start building your own web applications.",
        "id": "58428af6734d1d2b0ced5792",
        "image": "https://images-na.ssl-images-amazon.com/images/I/51qQTSKL2nL._SX430_BO1,204,203,200_.jpg",
        "isbn10": "2070464237",
        "pages": 736,
        "price": 25.9,
        "rating": 4,
        "title": "Head First JavaScript Programming",
        "votes": 141,
        "category": "JavaScript-Programming"
    },
    {
        "author": "Erich Gamma & Richard Helm",
        "description": "These texts cover the design of object-oriented software and examine how to investigate requirements, create solutions and then translate designs into code, showing developers how to make practical use of the most significant recent developments. A summary of UML notation is included.",
        "id": "58428b1a734d1d2b0ced5797",
        "image": "https://images-na.ssl-images-amazon.com/images/I/51szD9HC9pL._SX395_BO1,204,203,200_.jpg",
        "isbn10": "2070464237",
        "pages": 736,
        "price": 20.9,
        "rating": 4,
        "title": "Design Patterns",
        "votes": 141,
        "category": "Application-Architecture"
    },
    {
        "author": "Martin Fowler",
        "description": "The practice of enterprise application development has benefited from the emergence of many new enabling technologies. Multi-tiered object-oriented platforms, such as Java and .NET, have become commonplace. These new tools and technologies are capable of building powerful applications, but they are not easily implemented. Common failures in enterprise applications often occur because their developers do not understand the architectural lessons that experienced object developers have learned.",
        "id": "58428b74734d1d2b0ced57a0",
        "image": "https://images-na.ssl-images-amazon.com/images/I/51IuDvAU1CL._SX387_BO1,204,203,200_.jpg",
        "isbn10": "2070464237",
        "pages": 736,
        "price": 35.5,
        "rating": 4,
        "title": "Patterns of Enterprise Application Architecture",
        "votes": 141,
        "category": "Application-Architecture"
    },
    {
        "author": "Daniel H. Pink",
        "description": "Most people believe that the best way to motivate is with rewards like money—the carrot-and-stick approach. That's a mistake, says Daniel H. Pink (author of To Sell Is Human: The Surprising Truth About Motivating Others). In this provocative and persuasive new book, he asserts that the secret to high performance and satisfaction-at work, at school, and at home—is the deeply human need to direct our own lives, to learn and create new things, and to do better by ourselves and our world.",
        "id": "58428b90734d1d2b0ced57ac",
        "image": "https://images-na.ssl-images-amazon.com/images/I/419tQKzU2jL._SX330_BO1,204,203,200_.jpg",
        "isbn10": "2070464237",
        "pages": 736,
        "price": 40,
        "rating": 4,
        "title": "Drive: The Surprising Truth About What Motivates Us",
        "votes": 141,
        "category": "Motivation"
    },
    {
        "author": "Simon sinek",
        "description": "In 2009, Simon Sinek started a movement to help people become more inspired at work, and in turn inspire their colleagues and customers. Since then, millions have been touched by the power of his ideas, including more than 28 million who’ve watched his TED Talk based on START WITH WHY -- the third most popular TED video of all time.   Sinek starts with a fundamental question: Why are some people and organizations more innovative, more influential, and more profitable than others? Why do some command greater loyalty from customers and employees alike? Even among the successful, why are so few able to repeat their success over and over?",
        "id": "58428bab734d1d2b0ced57ae",
        "image": "https://images-na.ssl-images-amazon.com/images/I/51fRj1bsD5L._SX330_BO1,204,203,200_.jpg",
        "isbn10": "2070464237",
        "pages": 736,
        "price": 35.5,
        "rating": 4,
        "title": "Start with Why",
        "votes": 141,
        "category": "Motivation"
    },
    {
        "author": "Joshua Bloch",
        "description": "Are you looking for a deeper understanding of the Java™ programming language so that you can write code that is clearer, more correct, more robust, and more reusable? Look no further! Effective Java™, Second Edition, brings together seventy-eight indispensable programmer’s rules of thumb: working, best-practice solutions for the programming challenges you encounter every day.   This highly anticipated new edition of the classic, Jolt Award-winning work has been thoroughly updated to cover Java SE 5 and Java SE 6 features introduced since the first edition. Bloch explores new design patterns and language idioms, showing you how to make the most of features ranging from generics to enums, annotations to autoboxing",
        "id": "58428c11734d1d2b0ced57c8",
        "image": "https://images-na.ssl-images-amazon.com/images/I/51sRluR-aOL._SX359_BO1,204,203,200_.jpg",
        "isbn10": "2070464237",
        "pages": 736,
        "price": 35.5,
        "rating": 4,
        "title": "Effective Java (2nd Edition)",
        "votes": 141,
        "category": "Java-Programming"
    }
]